Rokasbarasa1/STM32-Quadcopter/src/main.c
        // altitude = get_sensor_fusion_altitude(bn357_get_altitude_meters() ,(double)bmp280_get_height_meters_from_reference(bn357_get_status_up_to_date(1)));
        mpu6050_get_accelerometer_readings_gravity(acceleration_data);
        mpu6050_get_gyro_readings_dps(gyro_angular);
        gy271_magnetometer_readings_micro_teslas(magnetometer_data);
        fix_mag_axis(magnetometer_data); // Switches around the x and the y to match mpu6050


        // Calculate using sensor data
        // get_ned_coordinates(acceleration_data, magnetometer_data, north_direction, east_direction, down_direction);
        calculate_degrees_x_y(acceleration_data, &accelerometer_x_rotation, &accelerometer_y_rotation);
        calculate_yaw(magnetometer_data, &accelerometer_z_rotation);
        convert_angular_rotation_to_degrees();

        
        // Joystick values, 50 is basically zero position
        throttle = 0;
        yaw = 50;
        pitch = 50;
        roll = 50;

        uint8_t data_received = 0;
        if(nrf24_data_available(1)){
            nrf24_receive(rx_data);
            extract_request_values((char*) rx_data, strlen((char*) rx_data), &throttle, &yaw, &pitch, &roll);
            data_received = 1;
        }


        // double error_altitude = mapValue(pid_get_error(&altitude_pid, altitude, HAL_GetTick()), -180.0, 180.0, -100.0, 100.0);
        // printf("Altitude error %6.2f ", error_altitude);
        
        double error_x = 0;
        double error_y = 0;
        if(data_received){
        // if(1){

            double error_altitude = 15;

            // x is facing to the sides
            // y is facing forwards and backwards
            error_x = mapValue(pid_get_error(&x_pid, gyro_degrees[0], HAL_GetTick()), -180.0, 180.0, -100.0, 100.0);
            error_y = mapValue(pid_get_error(&y_pid, gyro_degrees[1], HAL_GetTick()), -180.0, 180.0, -100.0, 100.0);


            // Disable y control when testing x
            error_y = 0;


            motor_power[0] = error_altitude + (-error_y) + (-error_x);
            motor_power[1] = error_altitude + (-error_y) +  (error_x);
            motor_power[2] = error_altitude +  (error_y) +  (error_x);
            motor_power[3] = error_altitude +  (error_y) + (-error_x);

            // motor_power[0] /= 2;
            // motor_power[1] /= 2;
            // motor_power[2] /= 2;
            // motor_power[3] /= 2;

            // GPS side
            TIM2->CCR1 = setServoActivationPercent(motor_power[2], MIN_ESC_PWM_VALUE, MAX_ESC_PWM_VALUE);
            TIM2->CCR2 = setServoActivationPercent(motor_power[3], MIN_ESC_PWM_VALUE, MAX_ESC_PWM_VALUE);

            // No gps side
            TIM1->CCR1 = setServoActivationPercent(motor_power[0], MIN_ESC_PWM_VALUE, MAX_ESC_PWM_VALUE);
            TIM1->CCR4 = setServoActivationPercent(motor_power[1], MIN_ESC_PWM_VALUE, MAX_ESC_PWM_VALUE);
            
            // printf(" ACTIVATION: motor0- %6.2f, motor1- %6.2f, motor2- %6.2f, motor3- %6.2f ", motor_power[0], motor_power[1], motor_power[2], motor_power[3]);
        }else{
            // GPS side
            TIM2->CCR1 = setServoActivationPercent(0, MIN_ESC_PWM_VALUE, MAX_ESC_PWM_VALUE);
            TIM2->CCR2 = setServoActivationPercent(0, MIN_ESC_PWM_VALUE, MAX_ESC_PWM_VALUE);

            // No gps side
            TIM1->CCR1 = setServoActivationPercent(0, MIN_ESC_PWM_VALUE, MAX_ESC_PWM_VALUE);
            TIM1->CCR4 = setServoActivationPercent(0, MIN_ESC_PWM_VALUE, MAX_ESC_PWM_VALUE);
        }
        
        // Print out for debugging
        // printf("ACCEL, %6.2f, %6.2f, %6.2f, ", acceleration_data[0], acceleration_data[1], acceleration_data[2]);
        // printf("GYRO, %6.2f, %6.2f, %6.2f, ", gyro_degrees[0], gyro_degrees[1], gyro_degrees[2]);
        // printf("AXIS, %6.2f, %6.2f, %6.2f, ", accelerometer_x_rotation, accelerometer_y_rotation, accelerometer_z_rotation);
        // printf("MAG, %6.2f, %6.2f, %6.2f, ", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);
        // printf("NORTH, %6.2f, %6.2f, %6.2f, ", north_direction[0], north_direction[1], north_direction[2]);
        // printf("TEMP %6.5f, ", temperature);
        // printf("ALT %6.2f, ", altitude);
        // printf("GPS %f, %f, ", longitude, latitude);
        // printf("ERROR x=%6.2f y=%6.2f", pid_get_error(&x_pid, gyro_degrees[0], HAL_GetTick()), pid_get_error(&y_pid, gyro_degrees[1], HAL_GetTick()));
        // printf("MOTOR 1=%6.2f 2=%6.2f 3=%6.2f 4=%6.2f", motor_power[0], motor_power[1], motor_power[2], motor_power[3]);
        // printf("ERROR x=%6.2f y=%6.2f ", error_x, error_y);
        // printf("\n");
        printf("Loop\n");

        handle_loop_timing();
    }
}

void init_STM32_peripherals(){
    HAL_Init();
    SystemClock_Config();
    MX_GPIO_Init();
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, 0);

    HAL_Delay(1);
    MX_DMA_Init(); // This has to be before the uart inits, otherwise dma interrupts dont work
    MX_I2C1_Init();
    MX_SPI1_Init();
    MX_TIM1_Init();
    MX_TIM2_Init();
    HAL_Delay(1);
    MX_USART2_UART_Init();
    MX_USART1_UART_Init();
    RetargetInit(&huart1);

    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2);

    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_SET);

    // HAL_UART_RegisterCallback(&huart2, HAL_UART_ERROR_CB_ID, HAL_UART_ErrorCallback);

    HAL_UARTEx_ReceiveToIdle_DMA(&huart2, receive_buffer, RxBuf_SIZE);
    __HAL_DMA_DISABLE_IT(&hdma_usart2_rx, DMA_IT_HT);
}

void calibrate_escs(){
    // Delay for things to settle down in the mcu init
    HAL_Delay(2000);

    // Set the max value
    uint16_t max_pwm = setServoActivationPercent(100, MIN_ESC_PWM_VALUE, MAX_ESC_PWM_VALUE);
    printf("Max: %d\n", max_pwm);
    TIM1->CCR1 = max_pwm;
    TIM1->CCR4 = max_pwm;
    TIM2->CCR1 = max_pwm;
    TIM2->CCR2 = max_pwm;
    HAL_Delay(3000);
    
