Rokasbarasa1/STM32-Quadcopter/src/main.c
    // Set the min value
    uint16_t min_pwm = setServoActivationPercent(0, MIN_ESC_PWM_VALUE, MAX_ESC_PWM_VALUE);
    printf("Min: %d\n", min_pwm);
    TIM1->CCR1 = min_pwm;
    TIM1->CCR4 = min_pwm;
    TIM2->CCR1 = min_pwm;
    TIM2->CCR2 = min_pwm;

    // 10 Seconds of min value init just to make sure
    HAL_Delay(10000);

    // After calibration remember that the 1 percent throttle might not do anything and it only starts moving at 3 percent throttle
    // This is if it is starting from 0
}

void init_sensors(){
    printf("-----------------------------INITIALIZING MODULES...\n");

    uint8_t mpu6050 = init_mpu6050(&hi2c1, 1, accelerometer_correction, gyro_correction);
    uint8_t gy271 = init_gy271(&hi2c1, 1, hard_iron_correction, soft_iron_correction);
    uint8_t bmp280 = init_bmp280(&hi2c1);
    uint8_t bn357 = init_bn357(&huart2, 0);
    uint8_t nrf24 = init_nrf24(&hspi1);

    printf("-----------------------------INITIALIZING MODULES DONE... ");

    if (mpu6050 && gy271 && bmp280 && bn357 && nrf24){
        printf("OK\n");
    }else{
        printf("NOT OK\n");
    }

    // Continue initializing
    nrf24_rx_mode(tx_address, 10);
}

void init_loop_timer(){
    loop_start_time = HAL_GetTick();
}

void check_calibrations(){
    // Checking errors of mpu6050
    find_accelerometer_error(1000);
    find_gyro_error(300);
}

void get_initial_position(){
    // Find the initial position in degrees and apply it to the gyro measurement integral
    // This will tell the robot which way to go to get the actual upward
    mpu6050_get_accelerometer_readings_gravity(acceleration_data);
    mpu6050_get_gyro_readings_dps(gyro_angular);
    gy271_magnetometer_readings_micro_teslas(magnetometer_data);
    fix_mag_axis(magnetometer_data); // Switches around the x and the y to match mpu6050

    calculate_degrees_x_y(acceleration_data, &accelerometer_x_rotation, &accelerometer_y_rotation);
    calculate_yaw(magnetometer_data, &accelerometer_z_rotation);

    gyro_degrees[0] = accelerometer_x_rotation;
    gyro_degrees[1] = accelerometer_y_rotation;
    gyro_degrees[2] = accelerometer_z_rotation;

    printf("Initial location x: %.2f y: %.2f, z: %.2f\n", gyro_degrees[0], gyro_degrees[1], gyro_degrees[2]);
}

void handle_loop_timing(){
    loop_end_time = HAL_GetTick();
    deltaLoopTime = loop_end_time - loop_start_time;
    // printf("Tim: %d ms\n", deltaLoopTime);
    if (deltaLoopTime < (1000 / refresh_rate_hz))
    {
        HAL_Delay((1000 / refresh_rate_hz) - deltaLoopTime);
    }
    loop_start_time = HAL_GetTick();
}

void convert_angular_rotation_to_degrees(){
    // Convert angular velocity to actual degrees that it moved and add it to the integral (dead reckoning not PID)
    gyro_degrees[0] += (gyro_angular[0] * (1.0 / refresh_rate_hz));
    gyro_degrees[1] += (gyro_angular[1] * (1.0 / refresh_rate_hz));
    gyro_degrees[2] += (gyro_angular[2] * (1.0 / refresh_rate_hz));

    // Apply complimentary filter
    // I have no idea why this version works. I tried the actually implementation and it was
    // not working good. This one though works very good.
    gyro_degrees[0] = -(-gyro_degrees[0] * (1.0 - complementary_ratio) - (complementary_ratio * accelerometer_x_rotation));
    gyro_degrees[1] = -(-gyro_degrees[1] * (1.0 - complementary_ratio) - (complementary_ratio * accelerometer_y_rotation));
    gyro_degrees[2] = -(-gyro_degrees[2] * (1.0 - complementary_ratio) - (complementary_ratio * accelerometer_z_rotation));

    // I dont want to track how many times the degrees went over the 360 degree mark, no point.
    while (gyro_degrees[0] > 180.0) {
        gyro_degrees[0] -= 360.0;
    }
    while (gyro_degrees[0] < -180.0) {
        gyro_degrees[0] += 360.0;
    }

    while (gyro_degrees[1] > 180.0) {
        gyro_degrees[1] -= 360.0;
    }
    while (gyro_degrees[1] < -180.0) {
        gyro_degrees[1] += 360.0;
    }

    while (gyro_degrees[2] > 180.0) {
        gyro_degrees[2] -= 360.0;
    }
    while (gyro_degrees[2] < -180.0) {
        gyro_degrees[2] += 360.0;
    }
}


// 0.5ms to 2ms = range is 1.5
// 0.5 is 2.5%  and is 25
// 2   is 10%   amd is 100
// 100 - 25 = 75

// default min and max is 25 and 75
uint16_t setServoActivationPercent(float percent, uint16_t minValue, uint16_t maxValue)
{
    if(percent > 100.0){
        percent = 1.0;
    }else if(percent < 0.0){
        percent = 0.0;
    }else{
        percent = percent / 100.0;
    }
    return percent * (maxValue - minValue) + minValue;
}

double mapValue(double value, double input_min, double input_max, double output_min, double output_max) {
    // Calculate the input and output ranges' lengths
    double input_range = input_max - input_min;
    double output_range = output_max - output_min;

    // Normalize the input value relative to the input range
    double normalized_value = (value - input_min) / input_range;

    // Scale the normalized value according to the output range
    double scaled_value = normalized_value * output_range;

    // Add the output range's minimum value to the scaled value
    double output_value = output_min + scaled_value;

    return output_value;
}

double get_sensor_fusion_altitude(double gps_altitude, double barometer_altitude){
    return gps_altitude + barometer_altitude;
}

void extract_request_values(char *request, uint8_t request_size, uint8_t *throttle, uint8_t *yaw, uint8_t *pitch, uint8_t *roll)
{
    char* start = strchr(request, '/') + 1;
    char* end = strchr(start, '/');
    int length = end - start;
    char throttle_string[length + 1];
    strncpy(throttle_string, start, length);
    throttle_string[length] = '\0';
    *throttle = atoi(throttle_string);
    //printf("'%s'\n", throttle_string);

    start = strchr(end, '/') + 1;
    end = strchr(start, '/');
    length = end - start;
    char yaw_string[length + 1];
    strncpy(yaw_string, start, length);
    yaw_string[length] = '\0';
    *yaw = atoi(yaw_string);
    //printf("'%s'\n", yaw_string);

    start = strchr(end, '/') + 1;
    end = strchr(start, '/');
    length = end - start;
    char pitch_string[length + 1];
    strncpy(pitch_string, start, length);
    pitch_string[length] = '\0';
    *pitch = atoi(pitch_string);
    //printf("'%s'\n", pitch_string);

    start = strchr(end, '/') + 1;
    end = strchr(start, '/');
    length = end - start;
    char roll_string[length + 1];
    strncpy(roll_string, start, length);
    roll_string[length] = '\0';
    *roll = atoi(roll_string);
    //printf("'%s'\n", roll_string);
}

void fix_mag_axis(float *magnetometer_data)
{
    float temp = 0.0;
    temp = magnetometer_data[0];
    // y is x
    magnetometer_data[0] = magnetometer_data[1];
    // x is -y
    magnetometer_data[1] = -temp;
}

/* Auto generated shit again-----------------------------------------------*/

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

